OpenROAD v2.0-3879-g0b8b7ae25 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/floorplan/4-io.def
[INFO ODB-0128] Design: adc_clkgen_with_edgedetect
[INFO ODB-0130]     Created 5 pins.
[INFO ODB-0131]     Created 203 components and 1221 component-terminals.
[INFO ODB-0133]     Created 206 nets and 409 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/floorplan/4-io.def
[INFO]: Setting RC values...
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met4 and clock max routing layer to met4. 
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 88320 138720
[INFO GPL-0006] NumInstances: 203
[INFO GPL-0007] NumPlaceInstances: 203
[INFO GPL-0008] NumFixedInstances: 0
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 206
[INFO GPL-0011] NumPins: 414
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 94000 150000
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 88320 138720
[INFO GPL-0016] CoreArea: 10585152000
[INFO GPL-0017] NonPlaceInstsArea: 0
[INFO GPL-0018] PlaceInstsArea: 5027321600
[INFO GPL-0019] Util(%): 47.49
[INFO GPL-0020] StdInstsArea: 5027321600
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG residual: 0.00156464 HPWL: 2978000
[InitialPlace]  Iter: 2 CG residual: 0.00021148 HPWL: 2964209
[InitialPlace]  Iter: 3 CG residual: 0.00003174 HPWL: 2985904
[InitialPlace]  Iter: 4 CG residual: 0.00002015 HPWL: 2987488
[InitialPlace]  Iter: 5 CG residual: 0.00000468 HPWL: 2989343
[INFO GPL-0031] FillerInit: NumGCells: 298
[INFO GPL-0032] FillerInit: NumGNets: 206
[INFO GPL-0033] FillerInit: NumGPins: 414
[INFO GPL-0023] TargetDensity: 0.70
[INFO GPL-0024] AveragePlaceInstArea: 24765131
[INFO GPL-0025] IdealBinArea: 35378760
[INFO GPL-0026] IdealBinCnt: 299
[INFO GPL-0027] TotalBinArea: 10585152000
[INFO GPL-0028] BinCnt: 64 64
[INFO GPL-0029] BinSize: 1294 1998
[INFO GPL-0030] NumBins: 4096
[NesterovSolve] Iter: 1 overflow: 0.777856 HPWL: 1638890
[INFO GPL-0100] worst slack 1e+30
[WARNING GPL-0102] No slacks found. Timing-driven mode disabled.
[NesterovSolve] Finished with Overflow: 0.777856
###############################################################################
# Created by write_sdc
# Thu Sep  8 19:22:55 2022
###############################################################################
current_design adc_clkgen_with_edgedetect
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {comp_trig}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ena_in}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start_conv}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_comp}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_dig}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {clk_comp}]
set_load -pin_load 0.0334 [get_ports {clk_dig}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comp_trig}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ena_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start_conv}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: start_conv (input port clocked by clk)
Endpoint: clkgen.delay_200ns_3.genblk1[1].delay_unit/in (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          2.00    2.00 v input external delay
                  0.01    0.01    2.01 v start_conv (in)
     2    0.01                           start_conv (net)
                  0.01    0.00    2.01 v _2_/B (sky130_fd_sc_hd__and2b_2)
                  0.04    0.18    2.19 v _2_/X (sky130_fd_sc_hd__and2b_2)
     1    0.00                           _0_ (net)
                  0.04    0.00    2.19 v _3_/A2 (sky130_fd_sc_hd__o21ba_2)
                  0.04    0.20    2.39 v _3_/X (sky130_fd_sc_hd__o21ba_2)
     1    0.00                           clkgen.delay_200ns_3._intsig_a_[1] (net)
                  0.04    0.00    2.39 v clkgen.delay_200ns_3.genblk1[1].delay_unit/in (sky130_mm_sc_hd_dly5ns)
                                  2.39   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          6.11e-07   3.42e-07   6.39e-10   9.54e-07 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  6.11e-07   3.42e-07   6.39e-10   9.54e-07 100.0%
                          64.0%      35.9%       0.1%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 5027 u^2 47% utilization.
area_report_end
