OpenROAD v2.0-3879-g0b8b7ae25 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_edge_detect_macrotest/runs/test/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/SKY130_SAR-ADC/openlane/adc_edge_detect_macrotest/runs/test/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_edge_detect_macrotest/runs/test/tmp/floorplan/4-io.def
[INFO ODB-0128] Design: adc_edge_detect_macrotest
[INFO ODB-0130]     Created 2 pins.
[INFO ODB-0131]     Created 3 components and 18 component-terminals.
[INFO ODB-0133]     Created 4 nets and 6 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_edge_detect_macrotest/runs/test/tmp/floorplan/4-io.def
[INFO]: Setting RC values...
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met4 and clock max routing layer to met4. 
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 94300 87040
[INFO GPL-0006] NumInstances: 3
[INFO GPL-0007] NumPlaceInstances: 3
[INFO GPL-0008] NumFixedInstances: 0
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 4
[INFO GPL-0011] NumPins: 8
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 100000 100000
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 94300 87040
[INFO GPL-0016] CoreArea: 6761484800
[INFO GPL-0017] NonPlaceInstsArea: 0
[INFO GPL-0018] PlaceInstsArea: 56304000
[INFO GPL-0019] Util(%): 0.83
[INFO GPL-0020] StdInstsArea: 56304000
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG residual: 0.00000011 HPWL: 132860
[InitialPlace]  Iter: 2 CG residual: 0.00000010 HPWL: 84409
[InitialPlace]  Iter: 3 CG residual: 0.00000001 HPWL: 84160
[InitialPlace]  Iter: 4 CG residual: 0.00000006 HPWL: 84160
[InitialPlace]  Iter: 5 CG residual: 0.00000007 HPWL: 84160
[INFO GPL-0031] FillerInit: NumGCells: 179
[INFO GPL-0032] FillerInit: NumGNets: 4
[INFO GPL-0033] FillerInit: NumGPins: 8
[INFO GPL-0023] TargetDensity: 0.40
[INFO GPL-0024] AveragePlaceInstArea: 18768000
[INFO GPL-0025] IdealBinArea: 46920000
[INFO GPL-0026] IdealBinCnt: 144
[INFO GPL-0027] TotalBinArea: 6761484800
[INFO GPL-0028] BinCnt: 64 64
[INFO GPL-0029] BinSize: 1388 1190
[INFO GPL-0030] NumBins: 4096
[NesterovSolve] Iter: 1 overflow: 0.460801 HPWL: 54810
[INFO GPL-0100] worst slack 1e+30
[WARNING GPL-0102] No slacks found. Timing-driven mode disabled.
[NesterovSolve] Snapshot saved at iter = 0
[NesterovSolve] Finished with Overflow: 0.460801
###############################################################################
# Created by write_sdc
# Wed Sep  7 15:27:31 2022
###############################################################################
current_design adc_edge_detect_macrotest
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: in (input port clocked by clk)
Endpoint: delay_macrocell_0/in (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ in (in)
     1    0.01                           in (net)
                  0.03    0.00    2.02 ^ delay_macrocell_0/in (delay_macrocell)
                                  2.02   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          3.91e-08   5.87e-08   1.05e-11   9.78e-08 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  3.91e-08   5.87e-08   1.05e-11   9.78e-08 100.0%
                          40.0%      60.0%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 56 u^2 1% utilization.
area_report_end
