###############################################################################
# Created by write_sdc
# Wed Oct 26 21:49:56 2022
###############################################################################
current_design adc_core_digital
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_dig -period 20.0000 
set_clock_uncertainty 0.2500 clk_dig
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {clk_dig_in}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {comparator_in}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_1_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {config_2_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {rst_n}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {conv_finished_out}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {enable_loop_out}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_bincap_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_bincap_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_bincap_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_c0_out_n}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_col_out_n[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_row_out_n[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {nmatrix_rowon_out_n[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_bincap_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_bincap_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_bincap_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_c0_out_n}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_col_out_n[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_row_out_n[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {pmatrix_rowon_out_n[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {result_out[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {sample_matrix_out}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {sample_matrix_out_n}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {sample_switch_out}]
set_output_delay 4.0000 -clock [get_clocks {clk_dig}] -add_delay [get_ports {sample_switch_out_n}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {conv_finished_out}]
set_load -pin_load 0.0334 [get_ports {enable_loop_out}]
set_load -pin_load 0.0334 [get_ports {nmatrix_c0_out_n}]
set_load -pin_load 0.0334 [get_ports {pmatrix_c0_out_n}]
set_load -pin_load 0.0334 [get_ports {sample_matrix_out}]
set_load -pin_load 0.0334 [get_ports {sample_matrix_out_n}]
set_load -pin_load 0.0334 [get_ports {sample_switch_out}]
set_load -pin_load 0.0334 [get_ports {sample_switch_out_n}]
set_load -pin_load 0.0334 [get_ports {nmatrix_bincap_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_bincap_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_bincap_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[31]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[30]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[29]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[28]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[27]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[26]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[25]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[24]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[23]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[22]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[21]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[20]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[19]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[18]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[17]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[16]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[15]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[14]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[13]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[12]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[11]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[10]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[9]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[8]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[7]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[6]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[5]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[4]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[3]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_col_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[15]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[14]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[13]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[12]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[11]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[10]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[9]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[8]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[7]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[6]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[5]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[4]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[3]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_row_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[15]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[14]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[13]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[12]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[11]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[10]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[9]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[8]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[7]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[6]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[5]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[4]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[3]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {nmatrix_rowon_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_bincap_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_bincap_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_bincap_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[31]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[30]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[29]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[28]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[27]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[26]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[25]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[24]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[23]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[22]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[21]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[20]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[19]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[18]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[17]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[16]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[15]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[14]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[13]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[12]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[11]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[10]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[9]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[8]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[7]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[6]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[5]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[4]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[3]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_col_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[15]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[14]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[13]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[12]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[11]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[10]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[9]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[8]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[7]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[6]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[5]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[4]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[3]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_row_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[15]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[14]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[13]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[12]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[11]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[10]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[9]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[8]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[7]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[6]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[5]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[4]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[3]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[2]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[1]}]
set_load -pin_load 0.0334 [get_ports {pmatrix_rowon_out_n[0]}]
set_load -pin_load 0.0334 [get_ports {result_out[15]}]
set_load -pin_load 0.0334 [get_ports {result_out[14]}]
set_load -pin_load 0.0334 [get_ports {result_out[13]}]
set_load -pin_load 0.0334 [get_ports {result_out[12]}]
set_load -pin_load 0.0334 [get_ports {result_out[11]}]
set_load -pin_load 0.0334 [get_ports {result_out[10]}]
set_load -pin_load 0.0334 [get_ports {result_out[9]}]
set_load -pin_load 0.0334 [get_ports {result_out[8]}]
set_load -pin_load 0.0334 [get_ports {result_out[7]}]
set_load -pin_load 0.0334 [get_ports {result_out[6]}]
set_load -pin_load 0.0334 [get_ports {result_out[5]}]
set_load -pin_load 0.0334 [get_ports {result_out[4]}]
set_load -pin_load 0.0334 [get_ports {result_out[3]}]
set_load -pin_load 0.0334 [get_ports {result_out[2]}]
set_load -pin_load 0.0334 [get_ports {result_out[1]}]
set_load -pin_load 0.0334 [get_ports {result_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_dig_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comparator_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_1_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_2_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
