OpenROAD v2.0-3879-g0b8b7ae25 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/routing/11-fill.def
[INFO ODB-0128] Design: adc_clkgen_with_edgedetect
[INFO ODB-0130]     Created 7 pins.
[INFO ODB-0131]     Created 1088 components and 4267 component-terminals.
[INFO ODB-0132]     Created 4 special nets and 4058 connections.
[INFO ODB-0133]     Created 106 nets and 209 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/foobar/tmp/routing/11-fill.def
###############################################################################
# Created by write_sdc
# Fri Sep  9 12:02:39 2022
###############################################################################
current_design adc_clkgen_with_edgedetect
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {comp_trig}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ena_in}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start_conv}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_comp}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_dig}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {clk_comp}]
set_load -pin_load 0.0334 [get_ports {clk_dig}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comp_trig}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ena_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start_conv}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[WARNING STA-0357] virtual clock clk can not be propagated.
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met4 and clock max routing layer to met4. 
-congestion_iterations 50 -verbose
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met4
[INFO GRT-0022] Global adjustment: 30%
[INFO GRT-0023] Grid origin: (0, 0)
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 0.6150
[INFO GRT-0019] Found 0 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 3
[INFO GRT-0003] Macros: 381
[INFO GRT-0004] Blockages: 1400

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal       5460          2407          55.92%
met2       Vertical         4095          2824          31.04%
met3       Horizontal       2730          1779          34.84%
met4       Vertical         1911          1170          38.78%
---------------------------------------------------------------

[INFO GRT-0197] Via related to pin nodes: 286
[INFO GRT-0198] Via related Steiner nodes: 0
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 337
[INFO GRT-0112] Final usage 3D: 1350

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1              2407            90            3.74%             0 /  0 /  0
met2              2824           249            8.82%             0 /  0 /  0
met3              1779             0            0.00%             0 /  0 /  0
met4              1170             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total             8180           339            4.14%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 3429 um
[INFO GRT-0014] Routed nets: 106
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: start_conv (input port clocked by clk)
Endpoint: clkgen.delay_100ns_3.genblk1[1].delay_unit/in (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          2.00    2.00 v input external delay
                  0.02    0.01    2.01 v start_conv (in)
     2    0.01                           start_conv (net)
                  0.02    0.00    2.01 v _2_/B (sky130_fd_sc_hd__and2b_2)
                  0.04    0.19    2.20 v _2_/X (sky130_fd_sc_hd__and2b_2)
     1    0.00                           _0_ (net)
                  0.04    0.00    2.20 v _3_/A2 (sky130_fd_sc_hd__o21ba_2)
                  0.04    0.20    2.40 v _3_/X (sky130_fd_sc_hd__o21ba_2)
     1    0.00                           clkgen.delay_100ns_3._intsig_a_[1] (net)
                  0.04    0.00    2.40 v clkgen.delay_100ns_3.genblk1[1].delay_unit/in (sky130_mm_sc_hd_dly5ns)
                                  2.40   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          6.13e-07   4.12e-07   1.39e-09   1.03e-06 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  6.13e-07   4.12e-07   1.39e-09   1.03e-06 100.0%
                          59.7%      40.1%       0.1%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 10416 u^2 98% utilization.
area_report_end
