OpenROAD v2.0-3879-g0b8b7ae25 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/RUN_2022.09.10_23.55.28/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/RUN_2022.09.10_23.55.28/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/RUN_2022.09.10_23.55.28/tmp/floorplan/7-pdn.def
[INFO ODB-0128] Design: adc_clkgen_with_edgedetect
[INFO ODB-0130]     Created 7 pins.
[INFO ODB-0131]     Created 189 components and 809 component-terminals.
[INFO ODB-0132]     Created 4 special nets and 630 connections.
[INFO ODB-0133]     Created 91 nets and 179 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/SKY130_SAR-ADC/openlane/adc_clkgen_with_edgedetect/runs/RUN_2022.09.10_23.55.28/tmp/floorplan/7-pdn.def
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met4 and clock max routing layer to met4. 
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 94300 62560
[INFO GPL-0006] NumInstances: 189
[INFO GPL-0007] NumPlaceInstances: 88
[INFO GPL-0008] NumFixedInstances: 101
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 91
[INFO GPL-0011] NumPins: 184
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 100000 75000
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 94300 62560
[INFO GPL-0016] CoreArea: 4588150400
[INFO GPL-0017] NonPlaceInstsArea: 221462400
[INFO GPL-0018] PlaceInstsArea: 2681321600
[INFO GPL-0019] Util(%): 61.40
[INFO GPL-0020] StdInstsArea: 2681321600
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG residual: 0.00000008 HPWL: 1637840
[InitialPlace]  Iter: 2 CG residual: 0.00000826 HPWL: 1646988
[InitialPlace]  Iter: 3 CG residual: 0.00000891 HPWL: 1659217
[InitialPlace]  Iter: 4 CG residual: 0.00000194 HPWL: 1661951
[InitialPlace]  Iter: 5 CG residual: 0.00000240 HPWL: 1661107
[INFO GPL-0031] FillerInit: NumGCells: 100
[INFO GPL-0032] FillerInit: NumGNets: 91
[INFO GPL-0033] FillerInit: NumGPins: 184
[INFO GPL-0023] TargetDensity: 0.70
[INFO GPL-0024] AveragePlaceInstArea: 30469563
[INFO GPL-0025] IdealBinArea: 43527948
[INFO GPL-0026] IdealBinCnt: 105
[INFO GPL-0027] TotalBinArea: 4588150400
[INFO GPL-0028] BinCnt: 64 64
[INFO GPL-0029] BinSize: 1388 808
[INFO GPL-0030] NumBins: 4096
[NesterovSolve] Iter: 1 overflow: 0.732989 HPWL: 698026
[NesterovSolve] Finished with Overflow: 0.732989
###############################################################################
# Created by write_sdc
# Sat Sep 10 23:55:34 2022
###############################################################################
current_design adc_clkgen_with_edgedetect
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {comp_trig}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ena_in}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {start_conv}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {clk_comp}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {clk_dig}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {clk_comp}]
set_load -pin_load 0.0334 [get_ports {clk_dig}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comp_trig}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ena_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start_conv}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: start_conv (input port clocked by __VIRTUAL_CLK__)
Endpoint: clkgen.delay_100ns_3.genblk1[1].delay_unit/in (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          2.00    2.00 v input external delay
                  0.01    0.01    2.01 v start_conv (in)
     2    0.01                           start_conv (net)
                  0.01    0.00    2.01 v _2_/B (sky130_fd_sc_hd__and2b_2)
                  0.03    0.18    2.19 v _2_/X (sky130_fd_sc_hd__and2b_2)
     1    0.00                           _0_ (net)
                  0.03    0.00    2.19 v _3_/A2 (sky130_fd_sc_hd__o21ba_2)
                  0.04    0.20    2.38 v _3_/X (sky130_fd_sc_hd__o21ba_2)
     1    0.00                           clkgen.delay_100ns_3._intsig_a_[1] (net)
                  0.04    0.00    2.38 v clkgen.delay_100ns_3.genblk1[1].delay_unit/in (sky130_mm_sc_hd_dlyPoly6ns)
                                  2.38   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          6.10e-07   3.35e-07   4.02e-10   9.45e-07 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  6.10e-07   3.35e-07   4.02e-10   9.45e-07 100.0%
                          64.5%      35.4%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 2903 u^2 63% utilization.
area_report_end
